# DuctSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings Class
Members See Also
---
The duct setting class.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DuctSettings : Element
```

Visual Basic
---
```text
Public Class DuctSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class DuctSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Mechanical..::..DuctSettings
# See Also
DuctSettings Members
Autodesk.Revit.DB.Mechanical Namespace